package ex3;

//1. 두 변수(국어, 영어)에 정수를 입력 받아 두 과목의 총점, 평균을 출력하는 프로그램을 작성하시오
//(1) 두 변수가 0보다 클 때만 총점, 평균을 구하며 0보다 크지 않을 때는 "계산할 수 없습니다"라는 메시지를 출력한다.
//(2) 출력 결과에 총점은 총점 : **점, 평균은 평균 : **.**점으로 출력형식을 맞춰 출력한다.
//(3) 메소드를 이용하여 총점 및 평균을 구하는 프로그램을 작성한다.
//(4) 객체를 별도로 작성하여 작성한 객체에 메소드를 작성하여 출력한다.
//프로젝트명, 패키지명, 파일이름, 객체이름, 필드이름, 메소드이름 등은 임의로 작성하여도 좋다.

/*
	1. 프로그램 명 : 국어, 영어 계산 프로그램
	2. 작성일 : 2023.05.03
	3. 윤도영
	4. 내용 : 국어, 영어 점수를 객체로 만들어 계산
*/

public class ShowOut {

	public static void main(String[] args) {
		Calc3 calc = new Calc3();
		
		calc.sum(55, 60);
		calc.sum(-50, 60);
		
	}
}
